Tekla.Structures.DirectManipulation.Model.Native.dotDMObjectFaces_t
Struct for the part faces.

Tekla.Structures.DirectManipulation.Model.Native.dotDMObjectFaces_t.id
The ID of the object containing the faces.

Tekla.Structures.DirectManipulation.Model.Native.dotDMObjectFaces_t.nFaces
The number of faces.

Tekla.Structures.DirectManipulation.Model.Native.dotDMObjectFaces_t.aFaces
The array containing the faces data.